# ###容器类型数据 (str list tuple dict set)

# ### str 字符串类型
"""用引号引起来的数据就是字符串"""

"""
# 转义字符: \
	(1) 将有意义的字符变得无意义
	(2) 将无意义的字符变得有意义 
	
\r\n,\n 代表换行
\t 代表缩进 (水平制表符)
\r 代表将后面的字符拉到当前行行首

可以用\把有意义的引号变得无意义
"""


# (1) 单引号
strvar = '我爱你亲爱的菇凉'
print(strvar,type(strvar))

# (2) 双引号 
strvar = "黑夜给我了黑色的眼睛,\n但是我却用它翻白眼"
strvar = "黑夜给我了黑色的眼睛,\t但是我却用它翻\r\n白眼"
strvar = "黑夜给我了黑色的眼睛,\r但是我却用它翻白眼"
strvar = "黑夜给我了\"黑色的\"眼睛"
print(strvar,type(strvar))

# (3) 三引号 (支持跨行 无需对单双引号重新转义)
strvar = """本来无一物,
何处惹尘埃"""
strvar = '''本来"无"一'物',
何处惹尘埃'''
print(strvar)


# ###元字符串 (原型化输出字符串,让转义字符失效)
strvar = r"黑夜给我了黑色的眼睛,\r但是我却用它翻白眼"
strvar = r"C:\Windows\System32\drivers\etc"
print(strvar)

# ###字符串的格式化
# %d %f %s   "字符串%d"  %  (值)

# %d 整型占位符
strvar = "徐欣欣是广东的一位美女,家里%d车豪车" % (10)
# %2d 默认数字具右
strvar = "徐欣欣是广东的一位美女,家里%2d车豪车" % (3)
# %-2d 默认数字具左
strvar = "徐欣欣是广东的一位美女,家里%-5d车豪车" % (3)
print(strvar)


# %f 浮点型占位符 (默认小数点后面保留6位)
strvar = "湖滨以前是折腾手机的,收入了%f元" % (9.99)
# %.1f 存在四舍五入
strvar = "湖滨以前是折腾手机的,收入了%.3f元" % (9.99)
print(strvar)


# %s 字符串占位符
strvar = "%s" % ("今天深圳由雨")
print(strvar)

# 综合案例
strvar = "肖成勇,一个月%.2f元,买了%d个娃娃,感觉身体%s" % (999.987,10,"被榨干")
print(strvar)



