# ### 字符串的格式化
'''
(5) format填充符号的使用(^ < >)
(6) 进制转换等特殊符号的使用
'''

# (5) 
"""
^ 原字符串局中 
< 原字符串局左
> 原字符串局右

who 关键字参数
*填充的符号
^居中 
10填充的个数(原字符串+填充字符 一共10个)
 
{who:*^10}
"""
strvar = "{who:*^10}在{where:>>8}玩,心情{feel:!<10}"
res = strvar.format(who="戴明雪",where="水里",feel="爽歪歪")
print(res)

# (6)
"""
:d 整型占位符
:f 浮点型占位符
:s 字符串占位符
:, 金钱占位符
"""
strvar = "龙阳周末买了{:d}个娃娃"
strvar = "龙阳周末买了{:3d}个娃娃"
strvar = "龙阳周末买了{:^10d}个娃娃"
res = strvar.format(10)
print(res)








