# (1)打印一行十个小星星
#**********
i = 0
while i<10:
	print("*",end="")
	i+=1
#help 查看帮助文档 help(print)
# help(print)

# (2)用一个变量打印出一行十个小星星 (十个小星星塞在一个变量中，最后达因变量)
print("<===>")
i = 0
strvar = ''
while i<10:
	strvar += "*"
	i+=1
# strvar = strvar + "*" + "*" + "*"
print(strvar)

# (3)打印一行十个小星星 奇数个打印★ 偶数个打印☆
'''
0 % 2 = 0
1 % 2 = 1
2 % 2 = 0
3 % 2 = 1
4 % 2 = 0
任意数n 与 2 取余 取值范围是0 , 1

0 % 3 = 0
1 % 3 = 1
2 % 3 = 2
3 % 3 = 0
4 % 3 = 1
5 % 3 = 2
任意数n 与 3 取余 取值范围是0,1,2

任意数n 与 m 取余 取值范围是 0 ~ (m-1)

'''
i = 0
while i<10:
	# 代码写在这
	
	# 余数为0  打印黑猩
	if i % 2 == 0:
		print("★",end="")
	else:
		#否则打印白星
		print("☆",end="")
	i+=1


# (4)用 一个循环 打印十行十列小星星
print()
i = 0
while i<100:
	# 输出小星星
	print("*",end="")
	# i 从0开始到99结束 
	# 任意数n与10取余 范围0 ~ 9 0代表第一个星星 9代表最后一个,正好10 , 如果是10个选择换行
	if i % 10 == 9:
		# 打印换行
		print()
	i+=1
"""
**********
**********
**********
**********
**********
**********
**********
**********
**********
**********
"""

# (5)一个循环 打印十行十列隔列变色小星星(一个循环)
i = 0
while i<100:
	# 输出小星星
	if i % 2 == 0:
		print("★",end="")
	else:
		print("☆",end="")
	
	# 最后换行
	if i % 10 == 9:
		print()
	
	i+=1
"""
# 格列变色
★☆★☆★☆★☆★☆ 
★☆★☆★☆★☆★☆
★☆★☆★☆★☆★☆
★☆★☆★☆★☆★☆
★☆★☆★☆★☆★☆
★☆★☆★☆★☆★☆
★☆★☆★☆★☆★☆
★☆★☆★☆★☆★☆
★☆★☆★☆★☆★☆
★☆★☆★☆★☆★☆
★☆★☆★☆★☆★☆
"""
# (6)一个循环 打印十行十列隔行变色小星星(一个循环)
"""
# 地板除算法
0 // 10 0
1 // 10 0
2 // 10 0
3 // 10 0
...
9 // 10 0

10 // 10 1
11 // 10 1
12 // 10 1
...
19 // 10 1

20 // 10 2
21 // 10 2
..
29 // 10 2

...
...
90 // 10 9 
91 // 10 9
..
99 // 10 9

0 // 3 0
1 // 3 0
2 // 3 0

3 // 3 1
4 // 3 1
5 // 3 1

10个0
10个1
10个2
10个3
...
10个9
=> 任意数和n进行地板除 : 会出现n个相同的数字

"""
#★☆
i = 0
while i<100:
	# 利用地板除与取余的规律 产生十个相同的数字,并且按10个相同的余数取花色
	if i // 10 % 2 == 0:
		print("★",end="")
	else:
		print("☆",end="")
	
	# 控制换行
	if i % 10 == 9:
		print()
	
	i+=1

'''
★★★★★★★★★★
☆☆☆☆☆☆☆☆☆☆
★★★★★★★★★★
☆☆☆☆☆☆☆☆☆☆
★★★★★★★★★★
☆☆☆☆☆☆☆☆☆☆
★★★★★★★★★★
☆☆☆☆☆☆☆☆☆☆
★★★★★★★★★★
☆☆☆☆☆☆☆☆☆☆
'''















